In [2]:
#pandas
import pandas as pd
import numpy as np
a=np.arange(1,11)

In [3]:
a

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [4]:
df=pd.DataFrame(a)

In [5]:
df

    0
0   1
1   2
2   3
3   4
4   5
5   6
6   7
7   8
8   9
9  10

In [6]:
df[(df>5)&(df<8)] #values between 5 and 8

     0
0  NaN
1  NaN
2  NaN
3  NaN
4  NaN
5  6.0
6  7.0
7  NaN
8  NaN
9  NaN

In [7]:
labels=['a','b','c']
lis=[10,20,30]
ar=np.array(lis)
d={'a':10,'b':20,'c':30}

In [8]:

ar,d

(array([10, 20, 30]), {'a': 10, 'b': 20, 'c': 30})

In [9]:
pd.Series(lis,index=labels)  #index is key word

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(data=lis,index=labels)

a    10
b    20
c    30
dtype: int64

In [11]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [12]:
d

{'a': 10, 'b': 20, 'c': 30}

In [13]:
#using index
s1=pd.Series([1,2,3,4],index=['usa','germany','ussr','japan'])
s1

usa        1
germany    2
ussr       3
japan      4
dtype: int64

In [14]:
s2=pd.Series([1,2,3,4],index=['usa','germany','italy','japan'])
s2

usa        1
germany    2
italy      3
japan      4
dtype: int64

In [15]:
s2['japan']

4

In [16]:
s1+s2

germany    4.0
italy      NaN
japan      8.0
usa        2.0
ussr       NaN
dtype: float64

In [17]:
s1,s2

(usa        1
 germany    2
 ussr       3
 japan      4
 dtype: int64,
 usa        1
 germany    2
 italy      3
 japan      4
 dtype: int64)

In [18]:
#dataframe
oly={'city':['atlanta','new york'],'year':[2012,2010],'no':[200,120]}

In [19]:
df=pd.DataFrame(oly)
df

       city  year   no
0   atlanta  2012  200
1  new york  2010  120

In [20]:
df1=pd.DataFrame(np.random.randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split()) # index is row
df1

          W         X         Y         Z
A -0.821338  0.179607  0.237519 -1.315131
B  0.119281 -1.374048 -0.689975 -0.107841
C  0.085016 -1.278022 -0.462614  1.833196
D -0.408364  0.020628  0.454283  0.125485
E  2.622002 -0.233419 -0.875150 -0.326528

In [21]:
# selection and indexing
df1.W

A   -0.821338
B    0.119281
C    0.085016
D   -0.408364
E    2.622002
Name: W, dtype: float64

In [22]:
df1['W']

A   -0.821338
B    0.119281
C    0.085016
D   -0.408364
E    2.622002
Name: W, dtype: float64

In [23]:
df1.loc['A']['Y']   #iloc used as index of the row

0.2375192543750795

In [24]:
df1['new']=df1['W']+df1['Z']

In [25]:
df1

          W         X         Y         Z       new
A -0.821338  0.179607  0.237519 -1.315131 -2.136469
B  0.119281 -1.374048 -0.689975 -0.107841  0.011440
C  0.085016 -1.278022 -0.462614  1.833196  1.918213
D -0.408364  0.020628  0.454283  0.125485 -0.282879
E  2.622002 -0.233419 -0.875150 -0.326528  2.295474

In [26]:
df1.drop('new',axis=1,inplace=True) #inplace used to delete a column permanently

In [29]:
df1

          W         X         Y         Z
A -0.821338  0.179607  0.237519 -1.315131
B  0.119281 -1.374048 -0.689975 -0.107841
C  0.085016 -1.278022 -0.462614  1.833196
D -0.408364  0.020628  0.454283  0.125485
E  2.622002 -0.233419 -0.875150 -0.326528

In [28]:
df1.iloc['A']  #while using iloc use only integer as index

TypeError: Cannot index by location index with a non-integer key

In [31]:
df1['new one']=df1['W'] +df1['X']
df1

          W         X         Y         Z   new one
A -0.821338  0.179607  0.237519 -1.315131 -0.641731
B  0.119281 -1.374048 -0.689975 -0.107841 -1.254767
C  0.085016 -1.278022 -0.462614  1.833196 -1.193006
D -0.408364  0.020628  0.454283  0.125485 -0.387736
E  2.622002 -0.233419 -0.875150 -0.326528  2.388583

In [34]:
# drop column
df1.drop('new one',axis= 1)   # 1 means column and 0 means row

          W         X         Y         Z
A -0.821338  0.179607  0.237519 -1.315131
B  0.119281 -1.374048 -0.689975 -0.107841
C  0.085016 -1.278022 -0.462614  1.833196
D -0.408364  0.020628  0.454283  0.125485
E  2.622002 -0.233419 -0.875150 -0.326528

In [35]:
# drop row
df1.drop('C',axis= 0) # remove row 'c'

          W         X         Y         Z   new one
A -0.821338  0.179607  0.237519 -1.315131 -0.641731
B  0.119281 -1.374048 -0.689975 -0.107841 -1.254767
D -0.408364  0.020628  0.454283  0.125485 -0.387736
E  2.622002 -0.233419 -0.875150 -0.326528  2.388583